### Terraform `plan` Succeeded for Workspace: `production`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3_bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           resources = [
+               "arn:aws:s3:::danielmaclaury.com/*",
            ]
+           sid       = "1"

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.acm_cert will be created
+   resource "aws_acm_certificate" "acm_cert" {
+       arn                       = (known after apply)
+       domain_name               = "danielmaclaury.com"
+       domain_validation_options = [
+           {
+               domain_name           = "danielmaclaury.com"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "www.danielmaclaury.com"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "danielmaclaury.com",
+           "www.danielmaclaury.com",
        ]
+       tags                      = {
+           "Environment" = "production"
+           "Name"        = "danielmaclaury.com"
        }
+       tags_all                  = {
+           "Environment" = "production"
+           "Name"        = "danielmaclaury.com"
        }
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"
    }

  # aws_cloudfront_distribution.s3_distribution will be created
+   resource "aws_cloudfront_distribution" "s3_distribution" {
+       aliases                        = [
+           "danielmaclaury.com",
+           "www.danielmaclaury.com",
        ]
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       default_root_object            = "index.html"
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = true
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_100"
+       retain_on_delete               = false
+       status                         = (known after apply)
+       tags                           = {
+           "Environment" = "production"
+           "Name"        = "danielmaclaury.com"
        }
+       tags_all                       = {
+           "Environment" = "production"
+           "Name"        = "danielmaclaury.com"
        }
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = true

+       custom_error_response {
+           error_code         = 403
+           response_code      = 403
+           response_page_path = "/error.html"
        }
+       custom_error_response {
+           error_code         = 404
+           response_code      = 404
+           response_page_path = "/error.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = false
+           default_ttl            = 3600
+           max_ttl                = 86400
+           min_ttl                = 0
+           target_origin_id       = "S3Origin"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = "S3Origin"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn      = (known after apply)
+           minimum_protocol_version = "TLSv1"
+           ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.origin_access_identity will be created
+   resource "aws_cloudfront_origin_access_identity" "origin_access_identity" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "danielmaclaury.com"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

  # aws_s3_bucket.website will be created
+   resource "aws_s3_bucket" "website" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "danielmaclaury.com"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "production"
+           "Name"        = "danielmaclaury.com"
        }
+       tags_all                    = {
+           "Environment" = "production"
+           "Name"        = "danielmaclaury.com"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.website will be created
+   resource "aws_s3_bucket_acl" "website" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.website will be created
+   resource "aws_s3_bucket_policy" "website" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # cloudflare_record.acm_validation["danielmaclaury.com"] will be created
+   resource "cloudflare_record" "acm_validation" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = (known after apply)
+       proxiable       = (known after apply)
+       ttl             = (known after apply)
+       type            = (known after apply)
+       value           = (known after apply)
+       zone_id         = "c69793a059c402a19939179ab4fb8ff2"
    }

  # cloudflare_record.acm_validation["www.danielmaclaury.com"] will be created
+   resource "cloudflare_record" "acm_validation" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = (known after apply)
+       proxiable       = (known after apply)
+       ttl             = (known after apply)
+       type            = (known after apply)
+       value           = (known after apply)
+       zone_id         = "c69793a059c402a19939179ab4fb8ff2"
    }

  # cloudflare_record.site_cname will be created
+   resource "cloudflare_record" "site_cname" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "danielmaclaury.com"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "CNAME"
+       value           = (known after apply)
+       zone_id         = "c69793a059c402a19939179ab4fb8ff2"
    }

  # cloudflare_record.site_cname_www will be created
+   resource "cloudflare_record" "site_cname_www" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "www.danielmaclaury.com"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "CNAME"
+       value           = (known after apply)
+       zone_id         = "c69793a059c402a19939179ab4fb8ff2"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>